<?php
// Вывести на экран все счастливые билеты. Счастливый билет - это когда сумма первых трех цифр в номере 
// билета равна сумме второй тройки цифр (номер шестизначный). Подсчитайте сколько счастливых билетов существует 
// и какой % они составляют от общего числа билетов.

// Пример: 123015 - счастливый.

// P.S. Старайтесь, чтобы ваше решение было
// 1. Изящным (не говнокод, а красивое решение)
// 2. Быстрым (не выполняющим лишних действий)

// Если не получается найти такое решение - решите хоть как-нибудь.



?>